OpenDTEF-v2012/tutorials/combustion/fireFoam/LES/compartmentFire/constant/panelRegion/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    energy          sensibleEnthalpy;
    equationOfState rhoConst;
    specie          specie;

}

mixture
{
    specie
    {
        molWeight   100;
    }

    transport
    {
        kappa   0.08;
    }

    thermodynamics
    {
        Hf      0;
        Cp      900;
    }

    equationOfState
    {
        rho     272;
    }
}


// ************************************************************************* //
